Microchip-MPLAB-Harmony/touch_apps/apps/qt7_selfcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/fuses.h
#define FUSES_BODCFG_ENABLE_Pos               _UINT32_(1)                                          /* (FUSES_BODCFG) BOD Enable Position */
#define FUSES_BODCFG_ENABLE_Msk               (_UINT32_(0x1) << FUSES_BODCFG_ENABLE_Pos)           /* (FUSES_BODCFG) BOD Enable Mask */
#define FUSES_BODCFG_ENABLE(value)            (FUSES_BODCFG_ENABLE_Msk & (_UINT32_(value) << FUSES_BODCFG_ENABLE_Pos)) /* Assignment of value for ENABLE in the FUSES_BODCFG register */
#define FUSES_BODCFG_STDBYCFG_Pos             _UINT32_(5)                                          /* (FUSES_BODCFG) BOD Configuration in Standby Sleep Mode Position */
#define FUSES_BODCFG_STDBYCFG_Msk             (_UINT32_(0x1) << FUSES_BODCFG_STDBYCFG_Pos)         /* (FUSES_BODCFG) BOD Configuration in Standby Sleep Mode Mask */
#define FUSES_BODCFG_STDBYCFG(value)          (FUSES_BODCFG_STDBYCFG_Msk & (_UINT32_(value) << FUSES_BODCFG_STDBYCFG_Pos)) /* Assignment of value for STDBYCFG in the FUSES_BODCFG register */
#define FUSES_BODCFG_RUNSTDBY_Pos             _UINT32_(6)                                          /* (FUSES_BODCFG) Run in Standby Position */
#define FUSES_BODCFG_RUNSTDBY_Msk             (_UINT32_(0x1) << FUSES_BODCFG_RUNSTDBY_Pos)         /* (FUSES_BODCFG) Run in Standby Mask */
#define FUSES_BODCFG_RUNSTDBY(value)          (FUSES_BODCFG_RUNSTDBY_Msk & (_UINT32_(value) << FUSES_BODCFG_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the FUSES_BODCFG register */
#define FUSES_BODCFG_ACTCFG_Pos               _UINT32_(8)                                          /* (FUSES_BODCFG) BOD Operation Mode in Active Mode Position */
#define FUSES_BODCFG_ACTCFG_Msk               (_UINT32_(0x1) << FUSES_BODCFG_ACTCFG_Pos)           /* (FUSES_BODCFG) BOD Operation Mode in Active Mode Mask */
#define FUSES_BODCFG_ACTCFG(value)            (FUSES_BODCFG_ACTCFG_Msk & (_UINT32_(value) << FUSES_BODCFG_ACTCFG_Pos)) /* Assignment of value for ACTCFG in the FUSES_BODCFG register */
#define   FUSES_BODCFG_ACTCFG_CONT_Val        _UINT32_(0x0)                                        /* (FUSES_BODCFG) Continuous Mode  */
#define   FUSES_BODCFG_ACTCFG_SAMP_Val        _UINT32_(0x1)                                        /* (FUSES_BODCFG) Sampling Mode  */
#define FUSES_BODCFG_ACTCFG_CONT              (FUSES_BODCFG_ACTCFG_CONT_Val << FUSES_BODCFG_ACTCFG_Pos) /* (FUSES_BODCFG) Continuous Mode Position */
#define FUSES_BODCFG_ACTCFG_SAMP              (FUSES_BODCFG_ACTCFG_SAMP_Val << FUSES_BODCFG_ACTCFG_Pos) /* (FUSES_BODCFG) Sampling Mode Position */
#define FUSES_BODCFG_SAMPFREQ_Pos             _UINT32_(12)                                         /* (FUSES_BODCFG) BOD Sampling Frequency Position */
#define FUSES_BODCFG_SAMPFREQ_Msk             (_UINT32_(0x1) << FUSES_BODCFG_SAMPFREQ_Pos)         /* (FUSES_BODCFG) BOD Sampling Frequency Mask */
#define FUSES_BODCFG_SAMPFREQ(value)          (FUSES_BODCFG_SAMPFREQ_Msk & (_UINT32_(value) << FUSES_BODCFG_SAMPFREQ_Pos)) /* Assignment of value for SAMPFREQ in the FUSES_BODCFG register */
#define   FUSES_BODCFG_SAMPFREQ_128HZ_Val     _UINT32_(0x0)                                        /* (FUSES_BODCFG) 128 Hz Sampling Frequency  */
#define   FUSES_BODCFG_SAMPFREQ_32HZ_Val      _UINT32_(0x1)                                        /* (FUSES_BODCFG) 32 Hz Sampling Frequency  */
#define FUSES_BODCFG_SAMPFREQ_128HZ           (FUSES_BODCFG_SAMPFREQ_128HZ_Val << FUSES_BODCFG_SAMPFREQ_Pos) /* (FUSES_BODCFG) 128 Hz Sampling Frequency Position */
#define FUSES_BODCFG_SAMPFREQ_32HZ            (FUSES_BODCFG_SAMPFREQ_32HZ_Val << FUSES_BODCFG_SAMPFREQ_Pos) /* (FUSES_BODCFG) 32 Hz Sampling Frequency Position */
#define FUSES_BODCFG_LEVEL_Pos                _UINT32_(16)                                         /* (FUSES_BODCFG) BOD Level Position */
#define FUSES_BODCFG_LEVEL_Msk                (_UINT32_(0x3) << FUSES_BODCFG_LEVEL_Pos)            /* (FUSES_BODCFG) BOD Level Mask */
#define FUSES_BODCFG_LEVEL(value)             (FUSES_BODCFG_LEVEL_Msk & (_UINT32_(value) << FUSES_BODCFG_LEVEL_Pos)) /* Assignment of value for LEVEL in the FUSES_BODCFG register */
#define   FUSES_BODCFG_LEVEL_BODLEVEL0_Val    _UINT32_(0x0)                                        /* (FUSES_BODCFG) 1.90V  */
#define   FUSES_BODCFG_LEVEL_BODLEVEL1_Val    _UINT32_(0x1)                                        /* (FUSES_BODCFG) 2.45V  */
#define   FUSES_BODCFG_LEVEL_BODLEVEL2_Val    _UINT32_(0x2)                                        /* (FUSES_BODCFG) 2.70V  */
#define   FUSES_BODCFG_LEVEL_BODLEVEL3_Val    _UINT32_(0x3)                                        /* (FUSES_BODCFG) 2.85V  */
#define FUSES_BODCFG_LEVEL_BODLEVEL0          (FUSES_BODCFG_LEVEL_BODLEVEL0_Val << FUSES_BODCFG_LEVEL_Pos) /* (FUSES_BODCFG) 1.90V Position */
#define FUSES_BODCFG_LEVEL_BODLEVEL1          (FUSES_BODCFG_LEVEL_BODLEVEL1_Val << FUSES_BODCFG_LEVEL_Pos) /* (FUSES_BODCFG) 2.45V Position */
#define FUSES_BODCFG_LEVEL_BODLEVEL2          (FUSES_BODCFG_LEVEL_BODLEVEL2_Val << FUSES_BODCFG_LEVEL_Pos) /* (FUSES_BODCFG) 2.70V Position */
#define FUSES_BODCFG_LEVEL_BODLEVEL3          (FUSES_BODCFG_LEVEL_BODLEVEL3_Val << FUSES_BODCFG_LEVEL_Pos) /* (FUSES_BODCFG) 2.85V Position */
#define FUSES_BODCFG_VLMLVL_Pos               _UINT32_(24)                                         /* (FUSES_BODCFG) Voltage Level Monitor Level Position */
#define FUSES_BODCFG_VLMLVL_Msk               (_UINT32_(0x3) << FUSES_BODCFG_VLMLVL_Pos)           /* (FUSES_BODCFG) Voltage Level Monitor Level Mask */
#define FUSES_BODCFG_VLMLVL(value)            (FUSES_BODCFG_VLMLVL_Msk & (_UINT32_(value) << FUSES_BODCFG_VLMLVL_Pos)) /* Assignment of value for VLMLVL in the FUSES_BODCFG register */
#define   FUSES_BODCFG_VLMLVL_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_BODCFG) VLM disabled  */
#define   FUSES_BODCFG_VLMLVL_5ABOVE_Val      _UINT32_(0x1)                                        /* (FUSES_BODCFG) VLM threshold is 5% above BOD threshold  */
#define FUSES_BODCFG_VLMLVL_OFF               (FUSES_BODCFG_VLMLVL_OFF_Val << FUSES_BODCFG_VLMLVL_Pos) /* (FUSES_BODCFG) VLM disabled Position */
#define FUSES_BODCFG_VLMLVL_5ABOVE            (FUSES_BODCFG_VLMLVL_5ABOVE_Val << FUSES_BODCFG_VLMLVL_Pos) /* (FUSES_BODCFG) VLM threshold is 5% above BOD threshold Position */
#define FUSES_BODCFG_VLMCFG_Pos               _UINT32_(26)                                         /* (FUSES_BODCFG) Voltage Level Monitor Interrupt Configuration Position */
#define FUSES_BODCFG_VLMCFG_Msk               (_UINT32_(0x3) << FUSES_BODCFG_VLMCFG_Pos)           /* (FUSES_BODCFG) Voltage Level Monitor Interrupt Configuration Mask */
#define FUSES_BODCFG_VLMCFG(value)            (FUSES_BODCFG_VLMCFG_Msk & (_UINT32_(value) << FUSES_BODCFG_VLMCFG_Pos)) /* Assignment of value for VLMCFG in the FUSES_BODCFG register */
#define   FUSES_BODCFG_VLMCFG_FALLING_Val     _UINT32_(0x0)                                        /* (FUSES_BODCFG) VDD falls below VLM threshold  */
#define   FUSES_BODCFG_VLMCFG_RISING_Val      _UINT32_(0x1)                                        /* (FUSES_BODCFG) VDD rises above VLM threshold  */
#define   FUSES_BODCFG_VLMCFG_BOTH_Val        _UINT32_(0x2)                                        /* (FUSES_BODCFG) VDD crosses VLM threshold  */
#define FUSES_BODCFG_VLMCFG_FALLING           (FUSES_BODCFG_VLMCFG_FALLING_Val << FUSES_BODCFG_VLMCFG_Pos) /* (FUSES_BODCFG) VDD falls below VLM threshold Position */
#define FUSES_BODCFG_VLMCFG_RISING            (FUSES_BODCFG_VLMCFG_RISING_Val << FUSES_BODCFG_VLMCFG_Pos) /* (FUSES_BODCFG) VDD rises above VLM threshold Position */
#define FUSES_BODCFG_VLMCFG_BOTH              (FUSES_BODCFG_VLMCFG_BOTH_Val << FUSES_BODCFG_VLMCFG_Pos) /* (FUSES_BODCFG) VDD crosses VLM threshold Position */
#define FUSES_BODCFG_WRTLOCK_Pos              _UINT32_(31)                                         /* (FUSES_BODCFG) Write Lock Position */
#define FUSES_BODCFG_WRTLOCK_Msk              (_UINT32_(0x1) << FUSES_BODCFG_WRTLOCK_Pos)          /* (FUSES_BODCFG) Write Lock Mask */
#define FUSES_BODCFG_WRTLOCK(value)           (FUSES_BODCFG_WRTLOCK_Msk & (_UINT32_(value) << FUSES_BODCFG_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the FUSES_BODCFG register */
#define FUSES_BODCFG_Msk                      _UINT32_(0x8F031162)                                 /* (FUSES_BODCFG) Register Mask  */


