Microchip-MPLAB-Harmony/touch_apps/apps/qt7_selfcap_xpro_board/pic32cm_pl10_cnano/firmware/src/packs/PIC32CM6408PL10048_DFP/component/fuses.h
/* -------- FUSES_SERNUM2 : (FUSES Offset: 0x30) ( R/ 32) Serial Number 2 -------- */
#define FUSES_SERNUM2_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_SERNUM2) Serial Number 2  Reset Value */

#define FUSES_SERNUM2_SERNUM2_Pos             _UINT32_(0)                                          /* (FUSES_SERNUM2) Serial Number 2 Position */
#define FUSES_SERNUM2_SERNUM2_Msk             (_UINT32_(0xFFFFFFFF) << FUSES_SERNUM2_SERNUM2_Pos)  /* (FUSES_SERNUM2) Serial Number 2 Mask */
#define FUSES_SERNUM2_SERNUM2(value)          (FUSES_SERNUM2_SERNUM2_Msk & (_UINT32_(value) << FUSES_SERNUM2_SERNUM2_Pos)) /* Assignment of value for SERNUM2 in the FUSES_SERNUM2 register */
#define FUSES_SERNUM2_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_SERNUM2) Register Mask  */


/* -------- FUSES_SERNUM3 : (FUSES Offset: 0x38) ( R/ 32) Serial Number 3 -------- */
#define FUSES_SERNUM3_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_SERNUM3) Serial Number 3  Reset Value */

#define FUSES_SERNUM3_SERNUM3_Pos             _UINT32_(0)                                          /* (FUSES_SERNUM3) Serial Number 3 Position */
#define FUSES_SERNUM3_SERNUM3_Msk             (_UINT32_(0xFFFFFFFF) << FUSES_SERNUM3_SERNUM3_Pos)  /* (FUSES_SERNUM3) Serial Number 3 Mask */
#define FUSES_SERNUM3_SERNUM3(value)          (FUSES_SERNUM3_SERNUM3_Msk & (_UINT32_(value) << FUSES_SERNUM3_SERNUM3_Pos)) /* Assignment of value for SERNUM3 in the FUSES_SERNUM3 register */
#define FUSES_SERNUM3_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_SERNUM3) Register Mask  */


/* FUSES register offsets definitions */
#define FUSES_SEQNUM_REG_OFST          _UINT32_(0x00)      /* (FUSES_SEQNUM) Sequence Number Fuse Offset */
#define FUSES_BOOTPROT_REG_OFST        _UINT32_(0x08)      /* (FUSES_BOOTPROT) Boot Protection Fuse Offset */
#define FUSES_WDTCFG_REG_OFST          _UINT32_(0x10)      /* (FUSES_WDTCFG) Watchdog Timer Configuration Fuse Offset */
#define FUSES_BODCFG_REG_OFST          _UINT32_(0x18)      /* (FUSES_BODCFG) BOD Configuration Fuse Offset */
#define FUSES_USERCFG_REG_OFST         _UINT32_(0x20)      /* (FUSES_USERCFG) User Configuration Fuse Offset */
#define FUSES_BOOT_GPIOSEL_REG_OFST    _UINT32_(0x28)      /* (FUSES_BOOT_GPIOSEL) Boot External Notification I/O Pin Fuse Offset */
#define FUSES_SERNUM0_REG_OFST         _UINT32_(0x20)      /* (FUSES_SERNUM0) Serial Number 0 Offset */
#define FUSES_SERNUM1_REG_OFST         _UINT32_(0x28)      /* (FUSES_SERNUM1) Serial Number 1 Offset */
#define FUSES_SERNUM2_REG_OFST         _UINT32_(0x30)      /* (FUSES_SERNUM2) Serial Number 2 Offset */
#define FUSES_SERNUM3_REG_OFST         _UINT32_(0x38)      /* (FUSES_SERNUM3) Serial Number 3 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* FUSES_BOOTCFG register API structure */
typedef struct
{  /* Non-Volatile Fuses */
  __IO  uint32_t                       FUSES_SEQNUM;       /* Offset: 0x00 (R/W  32) Sequence Number Fuse */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       FUSES_BOOTPROT;     /* Offset: 0x08 (R/W  32) Boot Protection Fuse */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       FUSES_WDTCFG;       /* Offset: 0x10 (R/W  32) Watchdog Timer Configuration Fuse */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       FUSES_BODCFG;       /* Offset: 0x18 (R/W  32) BOD Configuration Fuse */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       FUSES_USERCFG;      /* Offset: 0x20 (R/W  32) User Configuration Fuse */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       FUSES_BOOT_GPIOSEL; /* Offset: 0x28 (R/W  32) Boot External Notification I/O Pin Fuse */
} fuses_bootcfg_registers_t;

/* FUSES_SIGNATURE register API structure */
typedef struct
{  /* Non-Volatile Fuses */
  __I   uint8_t                        Reserved1[0x20];
  __I   uint32_t                       FUSES_SERNUM0;      /* Offset: 0x20 (R/   32) Serial Number 0 */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       FUSES_SERNUM1;      /* Offset: 0x28 (R/   32) Serial Number 1 */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint32_t                       FUSES_SERNUM2;      /* Offset: 0x30 (R/   32) Serial Number 2 */
  __I   uint8_t                        Reserved4[0x04];
  __I   uint32_t                       FUSES_SERNUM3;      /* Offset: 0x38 (R/   32) Serial Number 3 */
} fuses_signature_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_FUSES_COMPONENT_H_ */
